package main

import (
	"fmt"
)

// срез состоит из указателя на массив, длины и его емкости(максимальной длины)
// длина - количество элементов, на которые ссылается срез. емкость - количество элементов в базовом массиве
// "нарезание" не копирует данные среза, а создает новое значение среза, которое указывает на исходный массив
// при увеличении емкости среза, создается новый, больший срез и копируется в него содержимое исходного среза. емкость удваивается

func main() {
	var s = []string{"1", "2", "3"}
	modifySlice(s)
	fmt.Println(s)
}

func modifySlice(i []string) {
	i[0] = "3"
	// после увеличения емкости создается уже новый слайс со старыми данными и новой емкостью, поэтому дальнейшие изменения не отражаются
	i = append(i, "4")
	i[1] = "5"
	i = append(i, "6")
}
